In [25]:
import pandas as pd

In [27]:
salary_df = pd.read_csv('./data/Salary Dataset.csv')
salary_df = salary_df.dropna()
salary_df.head()

,Company Name,Job Title,Salaries Reported,Location,Salary
0,Mu Sigma,Data Scientist,105.0,Bangalore,"₹6,48,573/yr"
1,IBM,Data Scientist,95.0,Bangalore,"₹11,91,950/yr"
2,Tata Consultancy Services,Data Scientist,66.0,Bangalore,"₹8,36,874/yr"
3,Impact Analytics,Data Scientist,40.0,Bangalore,"₹6,69,578/yr"
4,Accenture,Data Scientist,32.0,Bangalore,"₹9,44,110/yr"

### Check data types. 
We will need to preprocess salary before converting to float

In [28]:
salary_df.dtypes

Company Name          object
Job Title             object
Salaries Reported    float64
Location              object
Salary                object
dtype: object

### Best practice to remove white space from column names

In [29]:
salary_df.columns = salary_df.columns.str.replace(' ', '_')

In [30]:
salary_df.head()

,Company_Name,Job_Title,Salaries_Reported,Location,Salary
0,Mu Sigma,Data Scientist,105.0,Bangalore,"₹6,48,573/yr"
1,IBM,Data Scientist,95.0,Bangalore,"₹11,91,950/yr"
2,Tata Consultancy Services,Data Scientist,66.0,Bangalore,"₹8,36,874/yr"
3,Impact Analytics,Data Scientist,40.0,Bangalore,"₹6,69,578/yr"
4,Accenture,Data Scientist,32.0,Bangalore,"₹9,44,110/yr"

### Remove characters from salary value

In [31]:
### Add another column that flags if the data is yearly or monthly

In [32]:
salary_df['Salary_'] = salary_df['Salary'].map(lambda x: ''.join([i for i in x if i.isdigit()]))

In [33]:
salary_df.head()

,Company_Name,Job_Title,Salaries_Reported,Location,Salary,Salary_
0,Mu Sigma,Data Scientist,105.0,Bangalore,"₹6,48,573/yr",648573
1,IBM,Data Scientist,95.0,Bangalore,"₹11,91,950/yr",1191950
2,Tata Consultancy Services,Data Scientist,66.0,Bangalore,"₹8,36,874/yr",836874
3,Impact Analytics,Data Scientist,40.0,Bangalore,"₹6,69,578/yr",669578
4,Accenture,Data Scientist,32.0,Bangalore,"₹9,44,110/yr",944110

### Convert to USD

In [34]:
exchange_rate = 0.013

In [35]:
salary_df['Salary_'] = salary_df['Salary_'].astype(float, errors = 'raise')

In [36]:
salary_df['Salary_USD'] = salary_df['Salary_'] * exchange_rate

In [37]:
salary_df.head()

,Company_Name,Job_Title,Salaries_Reported,Location,Salary,Salary_,Salary_USD
0,Mu Sigma,Data Scientist,105.0,Bangalore,"₹6,48,573/yr",648573.0,8431.449
1,IBM,Data Scientist,95.0,Bangalore,"₹11,91,950/yr",1191950.0,15495.350
2,Tata Consultancy Services,Data Scientist,66.0,Bangalore,"₹8,36,874/yr",836874.0,10879.362
3,Impact Analytics,Data Scientist,40.0,Bangalore,"₹6,69,578/yr",669578.0,8704.514
4,Accenture,Data Scientist,32.0,Bangalore,"₹9,44,110/yr",944110.0,12273.430